Tekla Open API Reference for Tekla Structures 2025
MaterialMarketSizesItemEnumerator.MoveNext Method
 Moves to the next item in the MaterialMarketSizesItemEnumerator.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MoveNext()
Public Function MoveNext As Boolean
Return Value
Type: Boolean
False on failure.
Implements
IEnumerator.MoveNext()
See Also
Reference
MaterialMarketSizesItemEnumerator Class
Tekla.Structures.Catalogs Namespace